In [1]:
import numpy as np
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]

BabyDataSet = list(zip(names,births))
BabyDataSet

[('Bob', 968), ('Jessica', 155), ('Mary', 77), ('John', 578), ('Mel', 973)]

In [2]:
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [3]:
s = pd.Series([1,3,6,np.nan,4.5,'test'])
s

0       1
1       3
2       6
3     NaN
4     4.5
5    test
dtype: object

In [5]:
s.dtypes

dtype('O')

In [7]:
## DatetimeIndex
dates = pd.date_range('20170101', periods=6)
dates

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06'],
              dtype='datetime64[ns]', freq='D')

## DataFrame

In [10]:
df = pd.DataFrame(np.random.random((6,4)),index=dates)
df

                   0         1         2         3
2017-01-01  0.603680  0.568948  0.347454  0.478346
2017-01-02  0.681363  0.820586  0.831749  0.701583
2017-01-03  0.795928  0.472620  0.280554  0.118257
2017-01-04  0.724708  0.161451  0.535644  0.469472
2017-01-05  0.439952  0.372697  0.085074  0.837937
2017-01-06  0.193062  0.948636  0.766538  0.059896

In [13]:
df1 = pd.DataFrame(np.arange(12).reshape((3,4)))
df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [14]:
df2 = pd.DataFrame({
    'A':1,
    'B':pd.Timestamp('20170101'),
    'C':pd.Series(1,index=list(range(4)),dtype='float32'),
    'D':np.array([3]*4,dtype='int32'),
    'E':pd.Categorical(['test','train','test','train']),
    'F':'Foo'
})
df2

   A          B    C  D      E    F
0  1 2017-01-01  1.0  3   test  Foo
1  1 2017-01-01  1.0  3  train  Foo
2  1 2017-01-01  1.0  3   test  Foo
3  1 2017-01-01  1.0  3  train  Foo

## 属性

In [15]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [16]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [17]:
df2.values

array([[1, Timestamp('2017-01-01 00:00:00'), 1.0, 3, 'test', 'Foo'],
       [1, Timestamp('2017-01-01 00:00:00'), 1.0, 3, 'train', 'Foo'],
       [1, Timestamp('2017-01-01 00:00:00'), 1.0, 3, 'test', 'Foo'],
       [1, Timestamp('2017-01-01 00:00:00'), 1.0, 3, 'train', 'Foo']], dtype=object)

In [20]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [21]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2017-01-01 00:00:00,2017-01-01 00:00:00,2017-01-01 00:00:00,2017-01-01 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,Foo,Foo,Foo,Foo

In [22]:
df2.sort_index(axis=1,ascending=False)

     F      E  D    C          B  A
0  Foo   test  3  1.0 2017-01-01  1
1  Foo  train  3  1.0 2017-01-01  1
2  Foo   test  3  1.0 2017-01-01  1
3  Foo  train  3  1.0 2017-01-01  1

In [24]:
df2.sort_values(by='E')

   A          B    C  D      E    F
0  1 2017-01-01  1.0  3   test  Foo
2  1 2017-01-01  1.0  3   test  Foo
1  1 2017-01-01  1.0  3  train  Foo
3  1 2017-01-01  1.0  3  train  Foo

## 选择数据

In [34]:
dates = pd.date_range('20170101',periods=6)
df = pd.DataFrame(np.arange(24).reshape((6,4)),index=dates,columns=['A','B','C','D'])
df

             A   B   C   D
2017-01-01   0   1   2   3
2017-01-02   4   5   6   7
2017-01-03   8   9  10  11
2017-01-04  12  13  14  15
2017-01-05  16  17  18  19
2017-01-06  20  21  22  23

In [35]:
df[0:3]

            A  B   C   D
2017-01-01  0  1   2   3
2017-01-02  4  5   6   7
2017-01-03  8  9  10  11

In [37]:
df['20170102':'20170105']

             A   B   C   D
2017-01-02   4   5   6   7
2017-01-03   8   9  10  11
2017-01-04  12  13  14  15
2017-01-05  16  17  18  19

In [38]:
df.loc['20170103']

A     8
B     9
C    10
D    11
Name: 2017-01-03 00:00:00, dtype: int32

In [42]:
df.loc[:,['A','B']]

             A   B
2017-01-01   0   1
2017-01-02   4   5
2017-01-03   8   9
2017-01-04  12  13
2017-01-05  16  17
2017-01-06  20  21

In [45]:
df.iloc[3,1:4]

B    13
C    14
D    15
Name: 2017-01-04 00:00:00, dtype: int32

In [46]:
df.iloc[[3,1,5],1:3]

             B   C
2017-01-04  13  14
2017-01-02   5   6
2017-01-06  21  22

In [47]:
df.ix[:3,['A','C']]

D:\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

            A   C
2017-01-01  0   2
2017-01-02  4   6
2017-01-03  8  10

In [48]:
df[df.A>8]

             A   B   C   D
2017-01-04  12  13  14  15
2017-01-05  16  17  18  19
2017-01-06  20  21  22  23

## 设置值

In [50]:
df.iloc[2,2] = 30
df

             A   B   C   D
2017-01-01   0   1   2   3
2017-01-02   4   5   6   7
2017-01-03   8   9  30  11
2017-01-04  12  13  14  15
2017-01-05  16  17  18  19
2017-01-06  20  21  22  23

In [51]:
df.A[df.A<12] = 0
df

             A   B   C   D
2017-01-01   0   1   2   3
2017-01-02   0   5   6   7
2017-01-03   0   9  30  11
2017-01-04  12  13  14  15
2017-01-05  16  17  18  19
2017-01-06  20  21  22  23

In [53]:
df['E'] = np.nan
df

             A   B   C   D   E
2017-01-01   0   1   2   3 NaN
2017-01-02   0   5   6   7 NaN
2017-01-03   0   9  30  11 NaN
2017-01-04  12  13  14  15 NaN
2017-01-05  16  17  18  19 NaN
2017-01-06  20  21  22  23 NaN

In [54]:
df['F'] = pd.Series([1,2,3,4,5,6],index=pd.date_range('20170101',periods=6))
df

             A   B   C   D   E  F
2017-01-01   0   1   2   3 NaN  1
2017-01-02   0   5   6   7 NaN  2
2017-01-03   0   9  30  11 NaN  3
2017-01-04  12  13  14  15 NaN  4
2017-01-05  16  17  18  19 NaN  5
2017-01-06  20  21  22  23 NaN  6

## 处理丢失数据

In [57]:
df1 = df.dropna(axis=0,how='any')
df1

Empty DataFrame
Columns: [A, B, C, D, E, F]
Index: []

In [58]:
df2= df.dropna(axis=1,how='any')
df2

             A   B   C   D  F
2017-01-01   0   1   2   3  1
2017-01-02   0   5   6   7  2
2017-01-03   0   9  30  11  3
2017-01-04  12  13  14  15  4
2017-01-05  16  17  18  19  5
2017-01-06  20  21  22  23  6

In [61]:
df3 = df.fillna(value=0)
df3

             A   B   C   D    E  F
2017-01-01   0   1   2   3  0.0  1
2017-01-02   0   5   6   7  0.0  2
2017-01-03   0   9  30  11  0.0  3
2017-01-04  12  13  14  15  0.0  4
2017-01-05  16  17  18  19  0.0  5
2017-01-06  20  21  22  23  0.0  6

In [62]:
df.isnull()

                A      B      C      D     E      F
2017-01-01  False  False  False  False  True  False
2017-01-02  False  False  False  False  True  False
2017-01-03  False  False  False  False  True  False
2017-01-04  False  False  False  False  True  False
2017-01-05  False  False  False  False  True  False
2017-01-06  False  False  False  False  True  False

In [63]:
np.any(df.isnull()) == True

True

## 导入导出数据